Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_XBAR_NUM_OUT221.h
#define XBAR_NUM_OUT221_SEL_SEL144_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL144_SHIFT         (0U)
/*! SEL144 - SEL144 */
#define XBAR_NUM_OUT221_SEL_SEL144(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL144_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL144_MASK)

#define XBAR_NUM_OUT221_SEL_SEL146_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL146_SHIFT         (0U)
/*! SEL146 - SEL146 */
#define XBAR_NUM_OUT221_SEL_SEL146(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL146_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL146_MASK)

#define XBAR_NUM_OUT221_SEL_SEL148_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL148_SHIFT         (0U)
/*! SEL148 - SEL148 */
#define XBAR_NUM_OUT221_SEL_SEL148(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL148_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL148_MASK)

#define XBAR_NUM_OUT221_SEL_SEL150_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL150_SHIFT         (0U)
/*! SEL150 - SEL150 */
#define XBAR_NUM_OUT221_SEL_SEL150(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL150_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL150_MASK)

#define XBAR_NUM_OUT221_SEL_SEL152_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL152_SHIFT         (0U)
/*! SEL152 - SEL152 */
#define XBAR_NUM_OUT221_SEL_SEL152(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL152_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL152_MASK)

#define XBAR_NUM_OUT221_SEL_SEL154_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL154_SHIFT         (0U)
/*! SEL154 - SEL154 */
#define XBAR_NUM_OUT221_SEL_SEL154(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL154_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL154_MASK)

#define XBAR_NUM_OUT221_SEL_SEL156_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL156_SHIFT         (0U)
/*! SEL156 - SEL156 */
#define XBAR_NUM_OUT221_SEL_SEL156(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL156_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL156_MASK)

#define XBAR_NUM_OUT221_SEL_SEL158_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL158_SHIFT         (0U)
/*! SEL158 - SEL158 */
#define XBAR_NUM_OUT221_SEL_SEL158(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL158_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL158_MASK)

#define XBAR_NUM_OUT221_SEL_SEL160_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL160_SHIFT         (0U)
/*! SEL160 - SEL160 */
#define XBAR_NUM_OUT221_SEL_SEL160(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL160_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL160_MASK)

#define XBAR_NUM_OUT221_SEL_SEL162_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL162_SHIFT         (0U)
/*! SEL162 - SEL162 */
#define XBAR_NUM_OUT221_SEL_SEL162(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL162_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL162_MASK)

#define XBAR_NUM_OUT221_SEL_SEL164_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL164_SHIFT         (0U)
/*! SEL164 - SEL164 */
#define XBAR_NUM_OUT221_SEL_SEL164(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL164_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL164_MASK)

#define XBAR_NUM_OUT221_SEL_SEL166_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL166_SHIFT         (0U)
/*! SEL166 - SEL166 */
#define XBAR_NUM_OUT221_SEL_SEL166(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL166_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL166_MASK)

#define XBAR_NUM_OUT221_SEL_SEL168_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL168_SHIFT         (0U)
/*! SEL168 - SEL168 */
#define XBAR_NUM_OUT221_SEL_SEL168(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL168_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL168_MASK)

#define XBAR_NUM_OUT221_SEL_SEL170_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL170_SHIFT         (0U)
/*! SEL170 - SEL170 */
#define XBAR_NUM_OUT221_SEL_SEL170(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL170_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL170_MASK)

#define XBAR_NUM_OUT221_SEL_SEL172_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL172_SHIFT         (0U)
/*! SEL172 - SEL172 */
#define XBAR_NUM_OUT221_SEL_SEL172(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL172_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL172_MASK)

#define XBAR_NUM_OUT221_SEL_SEL174_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL174_SHIFT         (0U)
/*! SEL174 - SEL174 */
#define XBAR_NUM_OUT221_SEL_SEL174(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL174_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL174_MASK)

#define XBAR_NUM_OUT221_SEL_SEL176_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL176_SHIFT         (0U)
/*! SEL176 - SEL176 */
#define XBAR_NUM_OUT221_SEL_SEL176(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL176_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL176_MASK)

#define XBAR_NUM_OUT221_SEL_SEL178_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL178_SHIFT         (0U)
/*! SEL178 - SEL178 */
#define XBAR_NUM_OUT221_SEL_SEL178(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL178_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL178_MASK)

#define XBAR_NUM_OUT221_SEL_SEL180_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL180_SHIFT         (0U)
/*! SEL180 - SEL180 */
#define XBAR_NUM_OUT221_SEL_SEL180(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL180_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL180_MASK)

#define XBAR_NUM_OUT221_SEL_SEL182_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL182_SHIFT         (0U)
/*! SEL182 - SEL182 */
#define XBAR_NUM_OUT221_SEL_SEL182(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL182_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL182_MASK)

#define XBAR_NUM_OUT221_SEL_SEL184_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL184_SHIFT         (0U)
/*! SEL184 - SEL184 */
#define XBAR_NUM_OUT221_SEL_SEL184(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL184_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL184_MASK)

