Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_XBAR_NUM_OUT221.h
#define XBAR_NUM_OUT221_SEL_SEL155_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL155_SHIFT         (8U)
/*! SEL155 - SEL155 */
#define XBAR_NUM_OUT221_SEL_SEL155(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL155_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL155_MASK)

#define XBAR_NUM_OUT221_SEL_SEL157_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL157_SHIFT         (8U)
/*! SEL157 - SEL157 */
#define XBAR_NUM_OUT221_SEL_SEL157(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL157_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL157_MASK)

#define XBAR_NUM_OUT221_SEL_SEL159_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL159_SHIFT         (8U)
/*! SEL159 - SEL159 */
#define XBAR_NUM_OUT221_SEL_SEL159(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL159_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL159_MASK)

#define XBAR_NUM_OUT221_SEL_SEL161_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL161_SHIFT         (8U)
/*! SEL161 - SEL161 */
#define XBAR_NUM_OUT221_SEL_SEL161(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL161_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL161_MASK)

#define XBAR_NUM_OUT221_SEL_SEL163_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL163_SHIFT         (8U)
/*! SEL163 - SEL163 */
#define XBAR_NUM_OUT221_SEL_SEL163(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL163_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL163_MASK)

#define XBAR_NUM_OUT221_SEL_SEL165_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL165_SHIFT         (8U)
/*! SEL165 - SEL165 */
#define XBAR_NUM_OUT221_SEL_SEL165(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL165_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL165_MASK)

#define XBAR_NUM_OUT221_SEL_SEL167_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL167_SHIFT         (8U)
/*! SEL167 - SEL167 */
#define XBAR_NUM_OUT221_SEL_SEL167(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL167_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL167_MASK)

#define XBAR_NUM_OUT221_SEL_SEL169_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL169_SHIFT         (8U)
/*! SEL169 - SEL169 */
#define XBAR_NUM_OUT221_SEL_SEL169(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL169_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL169_MASK)

#define XBAR_NUM_OUT221_SEL_SEL171_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL171_SHIFT         (8U)
/*! SEL171 - SEL171 */
#define XBAR_NUM_OUT221_SEL_SEL171(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL171_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL171_MASK)

#define XBAR_NUM_OUT221_SEL_SEL173_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL173_SHIFT         (8U)
/*! SEL173 - SEL173 */
#define XBAR_NUM_OUT221_SEL_SEL173(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL173_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL173_MASK)

#define XBAR_NUM_OUT221_SEL_SEL175_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL175_SHIFT         (8U)
/*! SEL175 - SEL175 */
#define XBAR_NUM_OUT221_SEL_SEL175(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL175_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL175_MASK)

#define XBAR_NUM_OUT221_SEL_SEL177_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL177_SHIFT         (8U)
/*! SEL177 - SEL177 */
#define XBAR_NUM_OUT221_SEL_SEL177(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL177_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL177_MASK)

#define XBAR_NUM_OUT221_SEL_SEL179_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL179_SHIFT         (8U)
/*! SEL179 - SEL179 */
#define XBAR_NUM_OUT221_SEL_SEL179(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL179_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL179_MASK)

#define XBAR_NUM_OUT221_SEL_SEL181_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL181_SHIFT         (8U)
/*! SEL181 - SEL181 */
#define XBAR_NUM_OUT221_SEL_SEL181(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL181_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL181_MASK)

#define XBAR_NUM_OUT221_SEL_SEL183_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL183_SHIFT         (8U)
/*! SEL183 - SEL183 */
#define XBAR_NUM_OUT221_SEL_SEL183(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL183_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL183_MASK)

#define XBAR_NUM_OUT221_SEL_SEL185_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL185_SHIFT         (8U)
/*! SEL185 - SEL185 */
#define XBAR_NUM_OUT221_SEL_SEL185(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL185_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL185_MASK)

#define XBAR_NUM_OUT221_SEL_SEL187_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL187_SHIFT         (8U)
/*! SEL187 - SEL187 */
#define XBAR_NUM_OUT221_SEL_SEL187(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL187_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL187_MASK)

#define XBAR_NUM_OUT221_SEL_SEL189_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL189_SHIFT         (8U)
/*! SEL189 - SEL189 */
#define XBAR_NUM_OUT221_SEL_SEL189(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL189_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL189_MASK)

#define XBAR_NUM_OUT221_SEL_SEL191_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL191_SHIFT         (8U)
/*! SEL191 - SEL191 */
#define XBAR_NUM_OUT221_SEL_SEL191(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL191_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL191_MASK)

#define XBAR_NUM_OUT221_SEL_SEL193_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL193_SHIFT         (8U)
/*! SEL193 - SEL193 */
#define XBAR_NUM_OUT221_SEL_SEL193(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL193_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL193_MASK)

#define XBAR_NUM_OUT221_SEL_SEL195_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL195_SHIFT         (8U)
/*! SEL195 - SEL195 */
#define XBAR_NUM_OUT221_SEL_SEL195(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL195_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL195_MASK)

#define XBAR_NUM_OUT221_SEL_SEL197_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL197_SHIFT         (8U)
/*! SEL197 - SEL197 */
#define XBAR_NUM_OUT221_SEL_SEL197(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL197_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL197_MASK)

#define XBAR_NUM_OUT221_SEL_SEL199_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL199_SHIFT         (8U)
/*! SEL199 - SEL199 */
#define XBAR_NUM_OUT221_SEL_SEL199(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL199_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL199_MASK)

#define XBAR_NUM_OUT221_SEL_SEL201_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL201_SHIFT         (8U)
/*! SEL201 - SEL201 */
#define XBAR_NUM_OUT221_SEL_SEL201(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL201_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL201_MASK)

